In [1]:
import pandas as pd

In [9]:
filepath = "Data_Files/Data.csv"
df=pd.read_csv(filepath)

In [11]:
df.head()

      name  age   department  salary
0    Alice   30           HR   50000
1      Bob   24  Engineering   60000
2  Charlie   26        Sales   55000
3    David   35  Engineering   80000
4      Eve   29           HR   52000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        11 non-null     object
 1   age         11 non-null     int64
 2   department  11 non-null     object
 3   salary      11 non-null     int64
dtypes: int64(2), object(2)
memory usage: 484.0+ bytes

In [15]:
df.describe()

             age        salary
count  11.000000     11.000000
mean   28.727273  58454.545455
std     3.744086   9299.071312
min    23.000000  50000.000000
25%    26.500000  52000.000000
50%    29.000000  55000.000000
75%    30.500000  61000.000000
max    35.000000  80000.000000

In [17]:
df.shape

(11, 4)

In [21]:
df.columns

Index(['name', 'age', 'department', 'salary'], dtype='object')

In [31]:
df.dtypes

name          object
age            int64
department    object
salary         int64
dtype: object

In [27]:
df.values

array([['Alice', 30, 'HR', 50000],
       ['Bob', 24, 'Engineering', 60000],
       ['Charlie', 26, 'Sales', 55000],
       ['David', 35, 'Engineering', 80000],
       ['Eve', 29, 'HR', 52000],
       ['Frank', 27, 'Sales', 58000],
       ['Grace', 31, 'Engineering', 70000],
       ['Hannah', 23, 'Sales', 53000],
       ['Ian', 34, 'HR', 51000],
       ['Jack', 28, 'Engineering', 62000],
       ['Eve', 29, 'HR', 52000]], dtype=object)

In [39]:
df["salary"]

0     50000
1     60000
2     55000
3     80000
4     52000
5     58000
6     70000
7     53000
8     51000
9     62000
10    52000
Name: salary, dtype: int64

In [45]:
df.iloc[1:5]

      name  age   department  salary
1      Bob   24  Engineering   60000
2  Charlie   26        Sales   55000
3    David   35  Engineering   80000
4      Eve   29           HR   52000

In [47]:
df.sort_values(by="age")

       name  age   department  salary
7    Hannah   23        Sales   53000
1       Bob   24  Engineering   60000
2   Charlie   26        Sales   55000
5     Frank   27        Sales   58000
9      Jack   28  Engineering   62000
4       Eve   29           HR   52000
10      Eve   29           HR   52000
0     Alice   30           HR   50000
6     Grace   31  Engineering   70000
8       Ian   34           HR   51000
3     David   35  Engineering   80000

In [61]:
df.sort_values(by="age")

       name  age   department  salary
7    Hannah   23        Sales   53000
1       Bob   24  Engineering   60000
2   Charlie   26        Sales   55000
5     Frank   27        Sales   58000
9      Jack   28  Engineering   62000
4       Eve   29           HR   52000
10      Eve   29           HR   52000
0     Alice   30           HR   50000
6     Grace   31  Engineering   70000
8       Ian   34           HR   51000
3     David   35  Engineering   80000

In [73]:
df.sort_values(by="department")

       name  age   department  salary
1       Bob   24  Engineering   60000
3     David   35  Engineering   80000
6     Grace   31  Engineering   70000
9      Jack   28  Engineering   62000
0     Alice   30           HR   50000
4       Eve   29           HR   52000
8       Ian   34           HR   51000
10      Eve   29           HR   52000
2   Charlie   26        Sales   55000
5     Frank   27        Sales   58000
7    Hannah   23        Sales   53000

In [85]:
df[df["department"]== "Sales" or  df["age"] <= 25 ]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [87]:
?()

Object `()` not found.

In [89]:
df["new_column"] = "default_value"

In [91]:
df

       name  age   department  salary     new_column
0     Alice   30           HR   50000  default_value
1       Bob   24  Engineering   60000  default_value
2   Charlie   26        Sales   55000  default_value
3     David   35  Engineering   80000  default_value
4       Eve   29           HR   52000  default_value
5     Frank   27        Sales   58000  default_value
6     Grace   31  Engineering   70000  default_value
7    Hannah   23        Sales   53000  default_value
8       Ian   34           HR   51000  default_value
9      Jack   28  Engineering   62000  default_value
10      Eve   29           HR   52000  default_value

In [97]:
df.drop(columns= ["new_column"])

       name  age   department  salary
0     Alice   30           HR   50000
1       Bob   24  Engineering   60000
2   Charlie   26        Sales   55000
3     David   35  Engineering   80000
4       Eve   29           HR   52000
5     Frank   27        Sales   58000
6     Grace   31  Engineering   70000
7    Hannah   23        Sales   53000
8       Ian   34           HR   51000
9      Jack   28  Engineering   62000
10      Eve   29           HR   52000

In [107]:
df.groupby("department")["salary"].mean()

department
Engineering    68000.000000
HR             51250.000000
Sales          55333.333333
Name: salary, dtype: float64

In [115]:
df.groupby("department").agg({"salary":["sum","mean", "median","std","var"]})

             salary
                sum          mean   median          std           var
department
Engineering  272000  68000.000000  66000.0  9092.121131  8.266667e+07
HR           205000  51250.000000  51500.0   957.427108  9.166667e+05
Sales        166000  55333.333333  55000.0  2516.611478  6.333333e+06

In [117]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        11 non-null     object
 1   age         11 non-null     int64
 2   department  11 non-null     object
 3   salary      11 non-null     int64
 4   new_column  11 non-null     object
dtypes: int64(2), object(3)
memory usage: 572.0+ bytes

In [119]:
df.values

array([['Alice', 30, 'HR', 50000, 'default_value'],
       ['Bob', 24, 'Engineering', 60000, 'default_value'],
       ['Charlie', 26, 'Sales', 55000, 'default_value'],
       ['David', 35, 'Engineering', 80000, 'default_value'],
       ['Eve', 29, 'HR', 52000, 'default_value'],
       ['Frank', 27, 'Sales', 58000, 'default_value'],
       ['Grace', 31, 'Engineering', 70000, 'default_value'],
       ['Hannah', 23, 'Sales', 53000, 'default_value'],
       ['Ian', 34, 'HR', 51000, 'default_value'],
       ['Jack', 28, 'Engineering', 62000, 'default_value'],
       ['Eve', 29, 'HR', 52000, 'default_value']], dtype=object)

In [121]:
df.isnull()

     name    age  department  salary  new_column
0   False  False       False   False       False
1   False  False       False   False       False
2   False  False       False   False       False
3   False  False       False   False       False
4   False  False       False   False       False
5   False  False       False   False       False
6   False  False       False   False       False
7   False  False       False   False       False
8   False  False       False   False       False
9   False  False       False   False       False
10  False  False       False   False       False

In [123]:
df.notnull()

    name   age  department  salary  new_column
0   True  True        True    True        True
1   True  True        True    True        True
2   True  True        True    True        True
3   True  True        True    True        True
4   True  True        True    True        True
5   True  True        True    True        True
6   True  True        True    True        True
7   True  True        True    True        True
8   True  True        True    True        True
9   True  True        True    True        True
10  True  True        True    True        True

In [125]:
data = {
'Name': ['Alice', 'Daniel', 'Charlie', None, 'Evelyn'],
'Age': [25, None, 30, 35, None],
'Gender': ['F', 'M', None, 'M', 'F']
}

In [127]:
import pandas as pd

In [131]:
df = pd.DataFrame(data)
df

      Name   Age Gender
0    Alice  25.0      F
1   Daniel   NaN      M
2  Charlie  30.0   None
3     None  35.0      M
4   Evelyn   NaN      F

In [133]:
#detect null values
df.isnull()

    Name    Age  Gender
0  False  False   False
1  False   True   False
2  False  False    True
3   True  False   False
4  False   True   False

In [135]:
df.isnull().any()

Name      True
Age       True
Gender    True
dtype: bool

In [137]:
df.isnull().sum()

Name      1
Age       2
Gender    1
dtype: int64

In [139]:
df.isnull().sum().any()

True

In [149]:
df[df.isnull().any(axis=1)]

ValueError: No axis named 1 for object type Series

In [151]:
df

0    False
1     True
2     True
3     True
4     True
dtype: bool

In [153]:
data = {
'Name': ['Alice', 'Daniel', 'Charlie', None, 'Evelyn'],
'Age': [25, None, 30, 35, None],
'Gender': ['F', 'M', None, 'M', 'F']
}

In [155]:
df = pd.DataFrame(data)
df

      Name   Age Gender
0    Alice  25.0      F
1   Daniel   NaN      M
2  Charlie  30.0   None
3     None  35.0      M
4   Evelyn   NaN      F

In [159]:
df[df.isnull().any(axis=1)]

      Name   Age Gender
1   Daniel   NaN      M
2  Charlie  30.0   None
3     None  35.0      M
4   Evelyn   NaN      F

In [161]:
df.duplicated

<bound method DataFrame.duplicated of       Name   Age Gender
0    Alice  25.0      F
1   Daniel   NaN      M
2  Charlie  30.0   None
3     None  35.0      M
4   Evelyn   NaN      F>

In [163]:
df[df.duplicated]

Empty DataFrame
Columns: [Name, Age, Gender]
Index: []

In [165]:
df = pd.DataFrame({"name": ["Alice", "Bob", "Alice"], "age": [25, 30, 25]})

In [167]:
df

    name  age
0  Alice   25
1    Bob   30
2  Alice   25

In [169]:
df[df.isnull().any(axis=1)]

Empty DataFrame
Columns: [name, age]
Index: []

In [171]:
df[df.duplicated]

    name  age
2  Alice   25